
  // Usage example:
  /*
  const convertor = cnConvertor();
  convertor.s2t('some text');
  */
  function cnConvertor() {
    const t = '內勻弔戶冊氾丟亙伕兇吒汙佇佔兌別刪吳呂囪壯夾妝決沖沒災禿見貝車迆兩來併並侖亞協兒卹姍屆岡彿拋東歿況爭狀玨糾羋臥軋長門俠侶係兗剋則勁卻奐姪姦屍帥恆彥後柵枴洶為爲牴盃紂紅紀紉紇約苧計訂訃貞負軍軌閂韋頁風飛倣倖倆們倀個倫倉凍剛剝員娛孫宮峽島師庫徑恥悅挾時晉書氣涇烏狹狽珮畝皰紡紗紋純紐紕級紜納紙紛脅脈芻荊茲記訐討訌訕訊託訓訖豈財貢釘針乾軒釗偺軔偽僞閃陣陝偉迺迴隻飢馬偵側鬥務動區參啞問唸啣國堅堊執夠婁婦專將屜崢崑崙帶帳張強彫從悽悵掃掛捫掄掙採捲捨敗啟啓敘斬晝勗桿梱棄梔條梟殺氫涼淺淵淒淚淪淨牽猙現琍產産畢異眾衆硃絆絃統紮紹紼絀細紳組終缽鉢習脣脫莢莖莊處術袞覓規訪訝訣訥許設訟訛販責貫貨貪貧軛軟這連逕釵釦釣釧閉陳陸陰頂頃魚鳥麥傖傘凱剴創勞勝勛傢備傑喪單喲喚喬圍堯場報壺尋嵐幀幾廁厠廂復惡悶揀愜惻惱揮換揚棗棟棧棲欽殘殼殻湧湊減渦湯測渾渙無猶琺甦畫痙發盜睏硯稈稅筆筍絞結絨絕絶絲絡給絢肅腎脹菸華菴萊虛視註詠評詞証詁詔詛詐詆訴診貯貼貳貽賁費賀貴買貶貿貸軻軸軼週進郵鄉鈔鈣鈕鈉鈞鈍鈐閔閏開雲閑韌間項順閒隊須階飪陽飯飩飲飭馮馭黃雋亂傭債傳嗎僅傾嗇傷傯嗚剷嗆勦園勢圓匯塗塚塊塢奧媽媼慄幹慍愾愴廈彙徬搾愛損搶搖搗暉暈會業極楊楨楓歲毀煩煉溝滅煬溼煥溫爺準獅滄瑯煙琿睞當睜痺盞祿萬稜稟節粵經絹綑綁綏義羨聖腸腳腫腦葷葦葉萵虜號蛻話誅補詭詢裝詮裡裏詬裊詫該賊詳資試賈詩賄詰貲誇賃詼賂詣賅誠跡較載軾輊農運遊達違過鄒鈷鉗鈸鈽鉀鈾鉛鉋鉤鈎鉑鈴閘隕電預頑頓頊頒頌飼飴飽飾馳馱馴鳩嘔僥嘆嘍僕嘖僑僱團圖劃塵匱厭墊塹嘗壽夥夢奪奩嫗寧實慇寢態暢對屢慣嶄慟嶇慚慘幣榮幗槓構摟彆摺摑徹槍氳滾漬漢滿滯漸漲漣滬漁滲滌爾犖獄瑤瑣瑪瘧瘍瘋瘉瘓盡監碩禎禍種稱窪窩箋箏綻綰綜綽綾綠緑緊綴網綱綺綢綿綵綸維緒緇罰聞誦蒐誌蒼語誣臺認誡與誤說説誥蝕誨蓆誘誑蒞貍蓋製賓賑蓀賒趙趕跼輔輒輕輓遠遜遙遞鉸銬銀銅銘頗銖領鉻颯銓颱銜餃閡餅閨餌閩餉閣駁閥骯閤際鳴鳶厲墮鳳嘮嫻麼麽嬋嫵齊嬌億嘩寬儀噓審寫價噴層儂儈嘯儉嘰幟凜廢劇廚劉墳廟劍墜廝廣廠彈憚憤徵慶摯慮撲憂撈撐慼慫撥撓慾憐憫撫撚敵數暫樣槨樁樞標樓槳樂樅歐殤毆漿潑潔澆潛潰潤澗熱犛獎奬瑩瘡皚皺盤瞇確碼緯緻緘穀緬緝編緣線窯窮緞緩綞範罵駡罷締練膠膚蓮蔭蔣蔔蔥蝦課蝸諉諂蝨調誰論衛諍衝豎竪複豬賠賞誼賦諒賤談賬諄賭誕賢請賣諸賜質踫踐輝輛輟輩輦輪輜適遷鄰鄭鄧醃鋅銻銷鋪鋤鋁銳鋭駝銼駐鋒駟閭駛閱閲駑駕駒駙髮鬧鞏頡颳魷養魯餓鴆餒鴉餘麩憊懍噥憶噯儘戰儔儐墾壇擁擋劑奮撻嬝據噹學擄導擇憲噸憑撿齒機擔歷燙燜曆曉澱燄濃獨樸澤樺濁璣甌橫樹熾盧橢燉燐橋燒瞞燈縑磚縈縛禦縣積穎穌窺膩簑築篤興篛艙篩縊蕩蕭蕪螞螢褲親覦諦諺諫諱謀諜諧諮諾謁謂諷諭貓賴踴鋼輻錫輯錄録輸錚錐辦錦閻選隨遲險遼遺霑錠錶鋸錳錯錢靜靦頰頸頻頷頭頹頽頤館餞餛餡駭駢駱鬨鮑鴕鴣鴦鴨鴒鴛龍龜勵嚀嚐嚇壓嬰嬪嬤尷優嶼償嶺嶽儲幫營彌檔燦應懇檢檜燭戲櫛燬殮燴濘擊濱牆墻濟獰擠獲擰濛濤環擬濫璦擱癆斂澀療斃濬盪曖糞瞭矯縮績繆縷磯縲繃縫禪總縱繅簍聲聰聯聳膿膽臉膾臨舉艱薑褸薔覬謎謗謙虧講謊謠謡謝謄谿螻賺賽蟈購趨褻轄輾轅輿還邁醞醖醜鍍鎂雖錨鍵鍊鍥韓鍋顆錘鎚颶鍾餵锺騁鍬駿鍛鮮鍰鮫闊鮪闋鴻闌鴿闈闆隱點隸齋叢嚕嚮壙壘嬸懣擴擲擾攆擺擻燻斷獷獵檳甕櫃檻癘檸癒櫂歟歸殯礎瀉禮瀋穡濾穢瀆竄濺竅簫瀏簞簣簡糧織繕繞繚繡綉罈罎翹職聶臍臏舊薩蹤藍軀轉藉轍邇蟯醫蟬醬蟲釐鎔覲鎊觴鎖謨鎢謹鎳謬鎮豐闔贅闖闐蹣雜雙雛雞鷄鞦額顏顔題顎顓颺餾餿餽騎鬆鯊懷鯉懶鯽鵑鵝攏鵠曠鼕櫥櫝櫚櫓嚥嚨壞瀟壟瀨壢寵瀝龐瀕廬懲爍牘犢獸獺璽瓊疇矇礙禱穫穩簾簽簷轔繫繭襠轎辭繹繩襖邊鏡繪譁羅譜鏑羶識鏟證鏃譚鏈臘譎鏜譏鏝藝贈藪贊鏢鏍鏘鏤藥鏗蟻關蠅蹺隴蠍離鵲難鵪鵬霧麗韜麴韻類願勸顛颼嚶饅嚴騖騙鬍鯨鯧寶鶉懸鵡懺攔攙朧瀾瀰爐犧獻瓏癢癥礦礪礬礫竇競蘊藴鏽銹闡蠔飄襤饒覺饑觸議騫騰騷譯鰓贏鰍贍鹹躉麵黨齟躂齣釋齡蘋鐘蘇鐃儷籌籃辮繽繼臚艦藹藺蘆囁囀囂屬懼懾攝攜櫻欄殲爛癩矓籐纏續蘭蘚蠣蠟襪覽譴護譽贓贜躊躍轟辯鐮鐳鐵鐺鐸鐲闢響顧驅驃驀騾髏鰭鰥鶯鶴鷂齜齦儼囈囉孿巔巒彎攤躑權轡歡鑄灑鑑灘鑒玀霽疊癮韃癬韁繮籠顫籟驕聾鬚聽鱉臟鰱襲鰾襯鰻讀鷓贖鷗贗贋鼴齬邏囑齪鑣壩龔鑠攬靨癱囌顯癲饜巖戀驚攣驛羈驗蠶攪髒竊籤體讓纓鱔讒纖鱗讖鱖贛蘿鷥釀靂蠱變黴靈靄邐韆觀顰躡驟釁鬢鑲魘鑰鷹顱鷺饞鹼鹽灤矚鼇齷讚齲驢驥廳欖纜灣躪籬鑽籮鑾蠻鑼鱷鰐鱸黷豔艷鑿鸚驪鬱鸞籲脛鎧鎬鷲緋剮飆燼饗鴝鋯噁砲椏殭闇佈劊崗暪薦饋勳';
    const s = '内匀吊户册泛丢亘夫凶咤污伫占兑别删吴吕囱壮夹妆决冲没灾秃见贝车迤两来并并仑亚协儿恤姗届冈佛抛东殁况争状珏纠芈卧轧长门侠侣系兖克则劲却奂侄奸尸帅恒彦后栅拐汹为为抵杯纣红纪纫纥约苎计订讣贞负军轨闩韦页风飞仿幸俩们伥个伦仓冻刚剥员娱孙宫峡岛师库径耻悦挟时晋书气泾乌狭狈佩亩疱纺纱纹纯纽纰级纭纳纸纷胁脉刍荆兹记讦讨讧讪讯托训讫岂财贡钉针干轩钊咱轫伪伪闪阵陕伟乃回只饥马侦侧斗务动区参哑问念衔国坚垩执够娄妇专将屉峥昆仑带帐张强雕从凄怅扫挂扪抡挣采卷舍败启启叙斩昼勖杆捆弃栀条枭杀氢凉浅渊凄泪沦净牵狰现璃产产毕异众众朱绊弦统扎绍绋绌细绅组终钵钵习唇脱荚茎庄处术衮觅规访讶诀讷许设讼讹贩责贯货贪贫轭软这连迳钗扣钓钏闭陈陆阴顶顷鱼鸟麦伧伞凯剀创劳胜勋家备杰丧单哟唤乔围尧场报壶寻岚帧几厕厕厢复恶闷拣惬恻恼挥换扬枣栋栈栖钦残壳壳涌凑减涡汤测浑涣无犹珐苏画痉发盗困砚秆税笔笋绞结绒绝绝丝络给绚肃肾胀烟华庵莱虚视注咏评词证诂诏诅诈诋诉诊贮贴贰贻贲费贺贵买贬贸贷轲轴轶周进邮乡钞钙钮钠钧钝钤闵闰开云闲韧间项顺闲队须阶饪阳饭饨饮饬冯驭黄隽乱佣债传吗仅倾啬伤偬呜铲呛剿园势圆汇涂冢块坞奥妈媪栗干愠忾怆厦汇彷榨爱损抢摇捣晖晕会业极杨桢枫岁毁烦炼沟灭炀湿焕温爷准狮沧琅烟珲睐当睁痹盏禄万棱禀节粤经绢捆绑绥义羡圣肠脚肿脑荤苇叶莴虏号蜕话诛补诡询装诠里里诟袅诧该贼详资试贾诗贿诘赀夸赁诙赂诣赅诚迹较载轼轾农运游达违过邹钴钳钹钚钾铀铅刨钩钩铂铃闸陨电预顽顿顼颁颂饲饴饱饰驰驮驯鸠呕侥叹喽仆啧侨雇团图划尘匮厌垫堑尝寿伙梦夺奁妪宁实殷寝态畅对屡惯崭恸岖惭惨币荣帼杠构搂别折掴彻枪氲滚渍汉满滞渐涨涟沪渔渗涤尔荦狱瑶琐玛疟疡疯愈痪尽监硕祯祸种称洼窝笺筝绽绾综绰绫绿绿紧缀网纲绮绸绵彩纶维绪缁罚闻诵搜志苍语诬台认诫与误说说诰蚀诲席诱诳莅狸盖制宾赈荪赊赵赶局辅辄轻挽远逊遥递铰铐银铜铭颇铢领铬飒铨台衔饺阂饼闺饵闽饷阁驳阀肮合际鸣鸢厉堕凤唠娴么么婵妩齐娇亿哗宽仪嘘审写价喷层侬侩啸俭叽帜凛废剧厨刘坟庙剑坠厮广厂弹惮愤征庆挚虑扑忧捞撑戚怂拨挠欲怜悯抚捻敌数暂样椁桩枢标楼桨乐枞欧殇殴浆泼洁浇潜溃润涧热牦奖奖莹疮皑皱盘眯确码纬致缄谷缅缉编缘缐窑穷缎缓缍范骂骂罢缔练胶肤莲荫蒋卜葱虾课蜗诿谄虱调谁论卫诤冲竖竖复猪赔赏谊赋谅贱谈账谆赌诞贤请卖诸赐质碰践辉辆辍辈辇轮辎适迁邻郑邓腌锌锑销铺锄铝锐锐驼锉驻锋驷闾驶阅阅驽驾驹驸发闹巩颉刮鱿养鲁饿鸩馁鸦余麸惫懔哝忆嗳尽战俦傧垦坛拥挡剂奋挞袅据当学掳导择宪吨凭捡齿机担历烫焖历晓淀焰浓独朴泽桦浊玑瓯横树炽卢椭炖磷桥烧瞒灯缣砖萦缚御县积颖稣窥腻蓑筑笃兴箬舱筛缢荡萧芜蚂萤裤亲觎谛谚谏讳谋谍谐谘诺谒谓讽谕猫赖踊钢辐锡辑录录输铮锥办锦阎选随迟险辽遗沾锭表锯锰错钱静䩄颊颈频颔头颓颓颐馆饯馄馅骇骈骆哄鲍鸵鸪鸯鸭鸰鸳龙龟励咛尝吓压婴嫔嬷尴优屿偿岭岳储帮营弥档灿应恳检桧烛戏栉毁殓烩泞击滨墙墙济狞挤获拧蒙涛环拟滥瑷搁痨敛涩疗毙浚荡暧粪了矫缩绩缪缕矶缧绷缝禅总纵缫篓声聪联耸脓胆脸脍临举艰姜褛蔷觊谜谤谦亏讲谎谣谣谢誊溪蝼赚赛蝈购趋亵辖辗辕舆还迈酝酝丑镀镁虽锚键炼锲韩锅颗锤锤飓钟喂钟骋锹骏锻鲜锾鲛阔鲔阕鸿阑鸽闱板隐点隶斋丛噜向圹垒婶懑扩掷扰撵摆擞熏断犷猎槟瓮柜槛疠柠愈棹欤归殡础泻礼沈穑滤秽渎窜溅窍箫浏箪篑简粮织缮绕缭绣绣坛坛翘职聂脐膑旧萨踪蓝躯转借辙迩蛲医蝉酱虫厘镕觐镑觞锁谟钨谨镍谬镇丰阖赘闯阗蹒杂双雏鸡鸡秋额颜颜题颚颛飏馏馊馈骑松鲨怀鲤懒鲫鹃鹅拢鹄旷冬橱椟榈橹咽咙坏潇垄濑坜宠沥庞濒庐惩烁牍犊兽獭玺琼畴蒙碍祷获稳帘签檐辚系茧裆轿辞绎绳袄边镜绘哗罗谱镝膻识铲证镞谭链腊谲镗讥镘艺赠薮赞镖镙锵镂药铿蚁关蝇跷陇蝎离鹊难鹌鹏雾丽韬麹韵类愿劝颠飕嘤馒严骛骗胡鲸鲳宝鹑悬鹉忏拦搀胧澜弥炉牺献珑痒症矿砺矾砾窦竞蕴蕴锈锈阐蚝飘褴饶觉饥触议骞腾骚译鳃赢鳅赡咸趸面党龃跶出释龄苹钟苏铙俪筹篮辫缤继胪舰蔼蔺芦嗫啭嚣属惧慑摄携樱栏歼烂癞眬藤缠续兰藓蛎蜡袜览谴护誉赃赃踌跃轰辩镰镭铁铛铎镯辟响顾驱骠蓦骡髅鳍鳏莺鹤鹞龇龈俨呓啰孪巅峦弯摊踯权辔欢铸洒鉴滩鉴猡霁叠瘾鞑癣缰缰笼颤籁骄聋须听鳖脏鲢袭鳔衬鳗读鹧赎鸥赝赝鼹龉逻嘱龊镳坝龚铄揽靥瘫苏显癫餍岩恋惊挛驿羁验蚕搅脏窃签体让缨鳝谗纤鳞谶鳜赣萝鸶酿雳蛊变霉灵霭逦千观颦蹑骤衅鬓镶魇钥鹰颅鹭馋硷盐滦瞩鳌龌赞龋驴骥厅榄缆湾躏篱钻箩銮蛮锣鳄鳄鲈黩艳艳凿鹦骊郁鸾吁胫铠镐鹫绯剐飙烬飨鸲锆恶炮桠僵暗布刽岗瞒荐馈勋';
  
    const mappingCache = {};
  
    function buildCache() {
      const t2sMap = {};
      const s2tMap = {};
      for (let i = 0; i < t.length; i++) {
        const tc = t.charAt(i);
        const sc = s.charAt(i);
        if (!t2sMap[tc]) {
          t2sMap[tc] = sc;
        }
        if (!s2tMap[sc]) {
          s2tMap[sc] = tc;
        }
      }
  
      mappingCache['t2s'] = t2sMap;
      mappingCache['s2t'] = s2tMap;
      return mappingCache;
    }
  
    function getCache() {
      if (Object.keys(mappingCache).length === 0) {
        return buildCache();
      }
      return mappingCache;
    }
  
    function t2s(txt) {
      if (!txt) {
        return txt;
      }
  
      if (txt.length === 0) {
        return txt;
      }
  
      const cache = getCache();
      const t2sCache = cache['t2s'];
      let result = '';
      for (let i = 0; i < txt.length; i++) {
        const c = txt.charAt(i);
        result += t2sCache[c] ? t2sCache[c] : c;
      }
      return result;
    }
  
    function s2t(txt) {
      if (!txt) {
        return txt;
      }
  
      if (txt.length === 0) {
        return txt;
      }
  
      const cache = getCache();
      const s2tCache = cache['s2t'];
      let result = '';
      for (let i = 0; i < txt.length; i++) {
        const c = txt.charAt(i);
        result += s2tCache[c] ? s2tCache[c] : c;
      }
      return result;
    }
  
    return {
      s2t,
      t2s,
    }
  }  
